{
    "version": "https://jsonfeed.org/version/1",
    "title": "ssac",
    "description": "",
    "home_page_url": "https://ssac-sggs.github.io/website",
    "feed_url": "https://ssac-sggs.github.io/website/feed.json",
    "user_comment": "",
    "icon": "https://ssac-sggs.github.io/website/media/website/SSAC-logo-5-1.png",
    "author": {
        "name": "sggs"
    },
    "items": [
        {
            "id": "https://ssac-sggs.github.io/website/benefits-of-study-abroad.html",
            "url": "https://ssac-sggs.github.io/website/benefits-of-study-abroad.html",
            "title": "BENEFITS OF STUDY ABROAD",
            "summary": "Skills studying abroad will give you&nbsp; Confidence Studying abroad can definitely help you find and build a sense of confidence you knew you always had, but that was hiding under the surface. Unless you find yourself going with a big group of friends or with&hellip;",
            "content_html": "\n    <h2 id=\"skills-studying-abroad-will-give-younbspbr\">\n      Skills studying abroad will give you&nbsp;<br>\n    </h2>\n\n    <h2 id=\"confidence\">\n      Confidence\n    </h2>\n\n  <p>\n    Studying abroad can definitely help you find and build a sense of confidence you knew you always had, but that was hiding under the surface. Unless you find yourself going with a big group of friends or with a lot of people from your school, studying abroad gives you somewhat of a fresh start. You can choose who you want to be. <br><br>Your confidence can come from a lot of things, but it all comes down to challenging yourself and learning new things while abroad. Something as simple as learning to navigate the local transportation system, or how to order food in another language will make you more confident in yourself and your capability.  <br><br>When you shine with self-confidence employers can see it. Your confidence will give employers faith in knowing that you can trust yourself, and that they can trust you in return to do your job. Confidence is definitely a valuable skill you will learn while studying abroad.\n  </p>\n\n    <h2 id=\"problem-solving-and-a-sense-of-responsibility\">\n      Problem solving and a sense of responsibility\n    </h2>\n\n  <p>\n    Even though you’ll have the time of your life studying abroad, there will be times when you’ll run into some roadblocks or challenges. This is where your problem solving skills will come in. <br><br>Maybe you got lost walking to class or had a set back trying to learn the local transportation system. You will be responsible for thinking out of the box through these challenges, and oftentimes on your own. Being responsible for managing things on your own is an important skill you’ll gain (and practice) from studying abroad. <br><br>At work, and other times in your life, you’ll be in situations where you’ll have to learn how to work through difficulties on your own. Having the experience of managing problems while in a foreign place will show that you have good problem solving skills and can produce solutions.\n  </p>\n\n    <h2 id=\"adaptability-\">\n      Adaptability \n    </h2>\n\n  <p>\n    One of the most important skills gained from study abroad is adaptability. This can also be linked to being culturally aware, but as you learn more about the new country you’re in you learn how to live like a local. <br><br>Living abroad will present you with new experiences, and sometimes obstacles, almost every day. Employers will understand that if you studied abroad, you would have had to learn how to adjust to your surroundings. This kind of flexibility is attractive to employers as they want to know that you’ll be a candidate who can adapt and persevere in times of change and difficulty. <br>\n  </p>\n\n    <h2 id=\"intercultural-communication-and-language\">\n      Intercultural communication and language\n    </h2>\n\n  <p>\n    Whether the country you are studying abroad in shares the same native language as you or not, we can guarantee that there will be some communication and language differences. While you’re studying abroad, you will gain intercultural communication skills from interacting with people from different cultures. <br><br>This skill is highly prized, as it shows employers that you’re able to communicate and work with people from diverse backgrounds. This skill can benefit you personally too, as you will find it easier to understand and communicate with others who are different and build stronger connections with them. <br>\n  </p>\n\n    <h2 id=\"empathy\">\n      Empathy\n    </h2>\n\n  <p>\n    As you become more culturally understanding of others, you learn to respect them. This also coincides with developing empathy. You may learn and read about the history, people, and culture of other countries in school. But, you learn more (and often more effectively) when you experience things in person. <br><br>Empathy is important in all aspects of life. You will also be able to connect to more people, and in easier ways. In the workplace, empathy is important to have when working in a team or with others, as you’ll be a much more understanding, less self-centered coworker. <br>\n  </p>\n\n    <h2 id=\"selfawareness\">\n      Self-awareness\n    </h2>\n\n  <p>\n    Arguably, this is one of the more important skills you will gain while studying abroad. A more heightened self-awareness can be triggered while studying abroad as you begin to settle into your new home. <br><br>There may be aspects of this new culture that you really like and want to use and adapt to your own lifestyle. Vice versa, living abroad can make you scrutinize what you like and don’t like about your own culture and lifestyle. <br><br>When you find yourself in situations that are unfamiliar to you, you become more vulnerable. This vulnerability forces you to assess who you are, and will maybe even make it more clear who or what you want to be.  <br><br>As you become more self-aware, you may start to challenge your own beliefs, and develop new perspectives on things. Personal prejudices and biases you have may also surface. Self-awareness is a special trait to have, because it shows that you can recognize your strengths and weaknesses, likes and dislikes, and things that matter to you. <br><br>Better yet, you may also discover new passions! <br>\n  </p>\n\n    <h2 id=\"cultural-awareness\">\n      Cultural awareness\n    </h2>\n\n  <p>\n    Cultural awareness is a skill achieved from studying abroad when you really make an effort to understand the new country and its culture that you’re living in. Being culturally sensitive is a crucial part to being able to adapt to, or being flexible with, foreign surroundings. <br><br>Plus, trying to integrate yourself into a new culture can be fun and done in ways such as learning a new language, trying new foods, chatting with the locals, and more!&nbsp;&nbsp;\n  </p>\n\n  <p>\n    \n  </p>",
            "author": {
                "name": "sggs"
            },
            "tags": [
            ],
            "date_published": "2022-07-26T00:27:43+05:30",
            "date_modified": "2022-07-26T00:27:43+05:30"
        }
    ]
}
